<!doctype html>

<html lang="en" dir="ltr">

  <head>
    <meta charset="utf-8">
<title>&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x5de5;&#x7a0b;&#x4e2d;&#x7684;&#x7ecf;&#x6d4e;&#x5b66;&#x95ee;&#x9898;</title>
<meta name="generator" content="Nue (nuejs.org)">
<meta name="date.updated" content="2024-01-12T14:03:51.425Z">
<meta name="viewport" content="width=device-width,initial-scale=1">
<meta name="description" content="&#x4ece;&#x7ecf;&#x6d4e;&#x5b66;&#x89d2;&#x5ea6;&#x6765;&#x89e3;&#x8bfb;&#xff0c;&#x4e3a;&#x4ec0;&#x4e48;&#x6211;&#x4eec;&#x8981;&#x505a;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x5de5;&#x7a0b;&#xff1f;&#x4e3a;&#x4ec0;&#x4e48;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x73b0;&#x5728;&#x8fd9;&#x4e48;&#x5bb9;&#x6613;&#x53d7;&#x5230;&#x5a01;&#x80c1;&#xff1f;&#x8fd9;&#x7bc7;&#x6587;&#x7ae0;&#x7ed3;&#x5408; Security Engineering &#x4e00;&#x4e66;&#x7b2c;&#x516b;&#x7ae0;&#x6765;&#x804a;&#x804a;&#x8fd9;&#x4e2a;&#x95ee;&#x9898;&#x3002;">
<meta property="article:published_time" content="2021-11-15T19:00:00.000Z">
<link rel="shortcut icon" type="image/jpg" src="/img/favicon.jpg">
<link href="/global/global.css" rel="stylesheet">
<link href="/posts/post.css" rel="stylesheet">
<script src="/global/main.js" type="module"></script>
<script src="/@nue/page-router.js" type="module"></script>
    
  <link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
  <link rel="manifest" href="/site.webmanifest">
  <link rel="preconnect" href="https://fonts.googleapis.com">
  <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
  <link href="https://fonts.googleapis.com/css2?family=Roboto+Flex:opsz,wght@8..144,400;8..144,700&amp;display=swap" rel="stylesheet">
  <link href="https://fonts.googleapis.com/css2?family=Roboto+Mono:wght@400;700&amp;display=swap" rel="stylesheet">
  <link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC:wght@400;700&amp;display=swap" rel="stylesheet">

  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.9.0/styles/default.min.css" integrity="sha512-hasIneQUHlh06VNBe7f6ZcHmeRTLIaQWFd43YriJ0UND19bvYRauxthDg8E4eVNPm9bRUhr5JGeqH7FRFXQu5g==" crossorigin="anonymous" referrerpolicy="no-referrer">
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/KaTeX/0.16.9/katex.min.css" integrity="sha512-fHwaWebuwA7NSF5Qg/af4UeDx9XqUpYpOGgubo3yWu+b2IQR4UeQwbb42Ti7gVAjNtVoI/I9TEoYeu9omwcC6g==" crossorigin="anonymous" referrerpolicy="no-referrer">

  </head>

  <body>
    <header class="flex">
  <a class="flex homelink" href="/">
    <img alt="Avatar image" width="64" height="64" src="/img/avatar.jpg">
    <strong>Harlan V. Wei (aka. Wei Chen)</strong>
  </a>
  <nav>
    <a target="_blank" href="mailto:contact@harlanwei.com">
      <img class="icon" width="30" height="30" src="/img/email.svg" alt="My Email">
    </a><a target="_blank" href="//twitter.com/imharlanwei">
      <img class="icon" width="30" height="30" src="/img/twitter.svg" alt="Twitter profile">
    </a><a target="_blank" href="//github.com/harlanwei/">
      <img class="icon" width="30" height="30" src="/img/github.svg" alt="Github projects">
    </a><a target="_blank" href="//www.linkedin.com/in/harlanwei/">
      <img class="icon" width="30" height="30" src="/img/linkedin.svg" alt="LinkedIn profile">
    </a>
  </nav>
</header>
    <main lang="zh-Hans">

  <h1>&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x5de5;&#x7a0b;&#x4e2d;&#x7684;&#x7ecf;&#x6d4e;&#x5b66;&#x95ee;&#x9898;</h1>

  <p>
    <time>November 16, 2021</time>
    <span> &#x2022; Photo credits: <a class="backlit" target="_blank" href="https://unsplash.com/@micheile">micheile henderson @ Unsplash</a></span>
  </p>

  <img class="hero" style="max-height: 400px; width: 100%; object-fit: cover;" src="https://images.unsplash.com/photo-1579621970590-9d624316904b?w=640" alt="Hero image for &#x4fe1;&#x606f;&#x5b89;&#x5168;&#x5de5;&#x7a0b;&#x4e2d;&#x7684;&#x7ecf;&#x6d4e;&#x5b66;&#x95ee;&#x9898;">

  <article>
    <blockquote>
<p>This post is only available in Chinese at this moment.</p>
</blockquote>
<p><strong>&#x8fd9;&#x7bc7;&#x6587;&#x7ae0;&#x662f;&#x6211;&#x5728;&#x9605;&#x8bfb; <em>Security Engineering</em> &#x7b2c;&#x516b;&#x7ae0;&#x65f6;&#x6240;&#x5199;&#x7684;&#x8bfb;&#x540e;&#x611f;&#x3002;&#x5176;&#x4e2d;&#x4e00;&#x4e9b;&#x5173;&#x4e8e;&#x5927;&#x516c;&#x53f8;&#x5bf9;&#x4fe1;&#x606f;&#x4f7f;&#x7528;&#x7684;&#x65b9;&#x5f0f;&#x4ec5;&#x4e3a;&#x6211;&#x4e2a;&#x4eba;&#x8bbe;&#x60f3;&#xff0c;&#x5e76;&#x4e0d;&#x4e00;&#x5b9a;&#x662f;&#x4e8b;&#x5b9e;&#xff0c;&#x8bf7;&#x8bfb;&#x8005;&#x6ce8;&#x610f;&#x3002;</strong></p>
<p>Ross Anderson &#x6240;&#x8457;&#x7684; <em>Security Engineering</em> &#x4e00;&#x4e66;&#x4e2d;&#xff0c;&#x7b2c;&#x516b;&#x7ae0;&#x4e13;&#x95e8;&#x4ece;&#x7ecf;&#x6d4e;&#x5b66;&#x89d2;&#x5ea6;&#x5206;&#x6790;&#x4e86;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x5de5;&#x7a0b;&#x4e2d;&#x7684;&#x79cd;&#x79cd;&#x95ee;&#x9898;&#x3002;</p>
<p>&#x8fd9;&#x4e2a;&#x89d2;&#x5ea6;&#x5f88;&#x6709;&#x8da3;&#x3002;&#x8868;&#x9762;&#x4e0a;&#x770b;&#xff0c;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x5de5;&#x7a0b;&#x4f3c;&#x4e4e;&#x4e0e;&#x7ecf;&#x6d4e;&#x5b66;&#x5e76;&#x65e0;&#x592a;&#x5927;&#x5173;&#x8054;&#xff0c;&#x4f46; Anderson &#x89e3;&#x91ca;&#x9053;&#xff0c;&#x5176;&#x5b9e;&#x7ecf;&#x6d4e;&#x5b66;&#x4e0e;&#x4eba;&#x7c7b;&#x793e;&#x4f1a;&#x7684;&#x65b9;&#x65b9;&#x9762;&#x9762;&#x90fd;&#x606f;&#x606f;&#x76f8;&#x5173;&#x3002;&#x4ece;&#x67d0;&#x79cd;&#x89d2;&#x5ea6;&#x4e0a;&#x8bf4;&#xff0c;&#x7ecf;&#x6d4e;&#x5b66;&#x7406;&#x8bba;&#x5b9e;&#x9645;&#x4e0a;&#x662f;&#x5206;&#x6790;&#x4eba;&#x7c7b;&#x793e;&#x4f1a;&#x884c;&#x4e3a;&#x7684;&#x5de5;&#x5177;&#xff0c;&#x56e0;&#x4e3a;&#x5927;&#x591a;&#x6570;&#x4eba;&#x90fd;&#x662f;&#x51fa;&#x4e8e;&#x81ea;&#x5229;&#x7684;&#x52a8;&#x673a;&#x6765;&#x884c;&#x52a8;&#xff0c;&#x4e0d;&#x80fd;&#x6307;&#x671b;&#x4eba;&#x6c38;&#x8fdc;&#x201c;&#x4e3a;&#x7231;&#x53d1;&#x7535;&#x201d;&#x3002;&#x4f7f;&#x7528;&#x7ecf;&#x6d4e;&#x5b66;&#x7684;&#x5de5;&#x5177;&#x53bb;&#x5206;&#x6790;&#x5404;&#x79cd;&#x884c;&#x4e3a;&#x7684;&#x6210;&#x672c;&#x4e0e;&#x6536;&#x76ca;&#xff0c;&#x5f80;&#x5f80;&#x80fd;&#x591f;&#x8d77;&#x5230;&#x9884;&#x6d4b;&#x884c;&#x4e3a;&#x7684;&#x6548;&#x679c;&#x3002;</p>
<h2>&#x4fe1;&#x606f;&#x4ea7;&#x4e1a;&#x5185;&#x7684;&#x5927;&#x516c;&#x53f8;&#x5784;&#x65ad;&#x7684;&#x5f62;&#x6210;</h2>
<p>&#x8d44;&#x672c;&#x4e3b;&#x4e49;&#x4f9d;&#x9760;&#x5e02;&#x573a;&#x6765;&#x8c03;&#x8282;&#x4eba;&#x7c7b;&#x793e;&#x4f1a;&#x7684;&#x884c;&#x4e3a;&#xff0c;&#x4f46;&#x5e02;&#x573a;&#x4e5f;&#x6709;&#x53ef;&#x80fd;&#x4f1a;&#x5931;&#x6548;&#xff0c;&#x5176;&#x4e2d;&#x7684;&#x4e00;&#x79cd;&#x60c5;&#x666f;&#x5c31;&#x662f;&#x5e02;&#x573a;&#x5784;&#x65ad;&#x8005;&#x3002;&#x5784;&#x65ad;&#x8005;&#x62e5;&#x6709;&#x7edd;&#x5bf9;&#x7684;&#x5b9a;&#x4ef7;&#x6743;&#xff0c;&#x4ed6;&#x4eec;&#x901a;&#x8fc7;&#x54c4;&#x62ac;&#x4ef7;&#x683c;&#x6765;&#x69a8;&#x53d6;&#x5269;&#x4f59;&#x4ef7;&#x503c;&#xff0c;&#x800c;&#x5904;&#x4e8e;&#x4fe1;&#x606f;&#x4e0d;&#x5bf9;&#x79f0;&#x53e6;&#x4e00;&#x7aef;&#x7684;&#x6d88;&#x8d39;&#x8005;&#x6709;&#x65f6;&#x751a;&#x81f3;&#x5e76;&#x4e0d;&#x77e5;&#x9053;&#x5b9a;&#x4ef7;&#x7684;&#x4e0d;&#x5408;&#x7406;&#x6027;&#xff1b;&#x4ed6;&#x4eec;&#x4e5f;&#x53ef;&#x4ee5;&#x5229;&#x7528;&#x81ea;&#x5df1;&#x7684;&#x5e02;&#x573a;&#x652f;&#x914d;&#x5730;&#x4f4d;&#x6765;&#x6324;&#x5151;&#x7ade;&#x4e89;&#x8005;&#xff0c;&#x4ece;&#x800c;&#x8fdb;&#x4e00;&#x6b65;&#x5de9;&#x56fa;&#x81ea;&#x5df1;&#x7684;&#x5784;&#x65ad;&#x5730;&#x4f4d;&#x3002;&#x51fa;&#x4e8e;&#x5784;&#x65ad;&#x7684;&#x8fd9;&#x4e00;&#x7279;&#x6027;&#xff08;&#x9020;&#x6210;&#x5e02;&#x573a;&#x5931;&#x6548;&#x3001;&#x4e25;&#x91cd;&#x5f71;&#x54cd;&#x521b;&#x65b0;&#xff09;&#xff0c;&#x5404;&#x4e2a;&#x56fd;&#x5bb6;&#x4e00;&#x822c;&#x90fd;&#x6709;&#x9488;&#x5bf9;&#x5784;&#x65ad;&#x7684;&#x6cd5;&#x5f8b;&#x6cd5;&#x89c4;&#x6765;&#x9650;&#x5236;&#x5784;&#x65ad;&#x8005;&#x3002;</p>
<p>&#x7136;&#x800c;&#xff0c;&#x4fe1;&#x606f;&#x65f6;&#x4ee3;&#x7684;&#x884c;&#x4e1a;&#x5784;&#x65ad;&#x8005;&#x76f8;&#x6bd4;&#x4ee5;&#x5f80;&#x53c8;&#x6709;&#x4e86;&#x4e00;&#x4e9b;&#x65b0;&#x7684;&#x7279;&#x5f81;&#x3002;&#x4fe1;&#x606f;&#x65f6;&#x4ee3;&#x7684;&#x5784;&#x65ad;&#x8005;&#x5e76;&#x4e0d;&#x76f4;&#x63a5;&#x64cd;&#x7eb5;&#x5e02;&#x573a;&#x4ef7;&#x683c;&#xff0c;&#x5b9e;&#x9645;&#x4e0a;&#x7531;&#x4e8e;&#x4fe1;&#x606f;&#x7684;&#x8fb9;&#x9645;&#x6210;&#x672c;&#x51e0;&#x4e4e;&#x4e3a;&#x96f6;&#xff08;&#x4fe1;&#x606f;&#x53ef;&#x4ee5;&#x968f;&#x610f;&#x590d;&#x5236;&#xff09;&#xff0c;&#x8fd9;&#x4e9b;&#x5784;&#x65ad;&#x8005;&#x4e5f;&#x6ca1;&#x6709;&#x4efb;&#x4f55;&#x4ef7;&#x683c;&#x5f04;&#x591f;&#x64cd;&#x7eb5;&#x3002;&#x7136;&#x800c;&#xff0c;&#x4fe1;&#x606f;&#x884c;&#x4e1a;&#x5185;&#x7684;&#x5784;&#x65ad;&#x8005;&#x5374;&#x66f4;&#x5bb9;&#x6613;&#x5f62;&#x6210;&#xff0c;&#x5176;&#x4e2d;&#x4e00;&#x4e2a;&#x539f;&#x56e0;&#x662f;&#x7f51;&#x7edc;&#x6548;&#x5e94;&#xff1a;&#x4fe1;&#x606f;&#x4ea7;&#x54c1;&#x5728;&#x5efa;&#x7acb;&#x4f0a;&#x59cb;&#x57fa;&#x672c;&#x53ea;&#x6709;&#x96f6;&#x6563;&#x7684;&#x7528;&#x6237;&#xff0c;&#x7136;&#x800c;&#x4e00;&#x65e6;&#x8d85;&#x8fc7;&#x67d0;&#x4e2a;&#x9608;&#x503c;&#xff0c;&#x7f51;&#x7edc;&#x6548;&#x5e94;&#x5f00;&#x59cb;&#x5f62;&#x6210;&#x652f;&#x914d;&#xff0c;&#x6bcf;&#x4e2a;&#x4eba;&#x90fd;&#x88ab;&#x8feb;&#x5f00;&#x59cb;&#x4f7f;&#x7528;&#x8fd9;&#x4e9b;&#x4ea7;&#x54c1;&#xff0c;&#x62d2;&#x7edd;&#x5408;&#x4f5c;&#x7684;&#x6210;&#x672c;&#x5927;&#x5927;&#x63d0;&#x9ad8;&#xff1b;&#x4e00;&#x4e2a;&#x4f8b;&#x5b50;&#x5c31;&#x662f; Facebook &#x548c; Instagram&#x3002;</p>
<h2>&#x5927;&#x516c;&#x53f8;&#x5784;&#x65ad;&#x7684;&#x5de9;&#x56fa;</h2>
<p>&#x8fd9;&#x4e9b;&#x5784;&#x65ad;&#x8005;&#x4e5f;&#x66f4;&#x5bb9;&#x6613;&#x5de9;&#x56fa;&#x81ea;&#x5df1;&#x7684;&#x5784;&#x65ad;&#x5730;&#x4f4d;&#x3002;&#x4e00;&#x4e2a;&#x5de9;&#x56fa;&#x65b9;&#x6cd5;&#x662f;&#x5927;&#x91cf;&#x6536;&#x96c6;&#x7528;&#x6237;&#x4fe1;&#x606f;&#xff0c;&#x5229;&#x7528;&#x8fd9;&#x4e9b;&#x4fe1;&#x606f;&#x6765;&#x63d0;&#x5347;&#x81ea;&#x8eab;&#x4ea7;&#x54c1;&#x7ade;&#x4e89;&#x529b;&#x3002;&#x4f8b;&#x5982;&#xff0c;Google &#x63a8;&#x51fa;&#x7684;&#x6d4f;&#x89c8;&#x5668;&#x4ea7;&#x54c1;&#x4f1a;&#x6536;&#x96c6;&#x7528;&#x6237;&#x7684;&#x8bbf;&#x95ee;&#x5386;&#x53f2;&#x4ee5;&#x53ca;&#x4f7f;&#x7528;&#x4e60;&#x60ef;&#x7b49;&#x4fe1;&#x606f;&#xff0c;&#x5e76;&#x5229;&#x7528;&#x8fd9;&#x4e9b;&#x4fe1;&#x606f;&#x8ba1;&#x7b97;&#x7528;&#x6237;&#x753b;&#x50cf;&#xff0c;&#x901a;&#x8fc7;&#x8fd9;&#x4e9b;&#x4fe1;&#x606f;&#x63d0;&#x5347;&#x5e7f;&#x544a;&#x5339;&#x914d;&#x5ea6;&#xff0c;&#x4ece;&#x800c;&#x63d0;&#x9ad8;&#x5e7f;&#x544a;&#x70b9;&#x51fb;&#x7387;&#xff0c;&#x5438;&#x5f15;&#x66f4;&#x591a;&#x5e7f;&#x544a;&#x4e3b;&#x5728; Google &#x5e7f;&#x544a;&#x5e73;&#x53f0;&#x4e0a;&#x8fdb;&#x884c;&#x6295;&#x653e;&#x3002;</p>
<p>&#x53e6;&#x4e00;&#x4e2a;&#x65b9;&#x6cd5;&#x662f;&#x8425;&#x9020;&#x4fe1;&#x606f;&#x7684;&#x4e0d;&#x5bf9;&#x79f0;&#xff0c;&#x9501;&#x5b9a;&#x7528;&#x6237;&#xff0c;&#x6324;&#x5151;&#x7ade;&#x4e89;&#x5bf9;&#x624b;&#x3002;&#x4e3a;&#x4e86;&#x5de9;&#x56fa;&#x81ea;&#x8eab;&#x7684;&#x5784;&#x65ad;&#x5730;&#x4f4d;&#xff0c;&#x5927;&#x516c;&#x53f8;&#x4f1a;&#x6536;&#x96c6;&#x7528;&#x6237;&#x4fe1;&#x606f;&#x6765;&#x4e86;&#x89e3;&#x7528;&#x6237;&#x9700;&#x8981;&#x4ec0;&#x4e48;&#x6837;&#x7684;&#x65b0;&#x4ea7;&#x54c1;&#xff0c;&#x5e76;&#x5efa;&#x7acb;&#x62a4;&#x57ce;&#x6cb3;&#x5c06;&#x7528;&#x6237;&#x9501;&#x5b9a;&#xff08;lock-in&#xff09;&#x5728;&#x81ea;&#x5df1;&#x7684;&#x751f;&#x6001;&#x7cfb;&#x7edf;&#x5185;&#x3002;&#x4f8b;&#x5982;&#xff0c;Google &#x53d1;&#x73b0;&#x7528;&#x6237;&#x7ecf;&#x5e38;&#x5728;&#x641c;&#x7d22;&#x8fc7;&#x7a0b;&#x4e2d;&#x8bbf;&#x95ee;&#x529e;&#x516c;&#x6587;&#x6863;&#xff0c;&#x4fbf;&#x63a8;&#x51fa;&#x514d;&#x8d39;&#x7684;&#x6587;&#x6863;&#x670d;&#x52a1; Google Docs&#xff0c;&#x5728;&#x641c;&#x7d22;&#x8fc7;&#x7a0b;&#x4e2d;&#x641c;&#x96c6;&#x5230;&#x7684;&#x4efb;&#x4f55;&#x6587;&#x6863;&#x90fd;&#x53ef;&#x4ee5;&#x76f4;&#x63a5;&#x5728; Google Docs &#x4e2d;&#x6253;&#x5f00;&#xff0c;&#x800c;&#x4e0d;&#x9700;&#x8981;&#x4ed8;&#x8d39;&#x4f7f;&#x7528;&#x9700;&#x8981;&#x4e0b;&#x8f7d;&#x7684; Microsoft Office&#x3002;&#x5728; Google Docs &#x4e2d;&#xff0c;&#x7528;&#x6237;&#x8fd8;&#x53ef;&#x4ee5;&#x548c;&#x5176;&#x4ed6;&#x7528;&#x6237;&#x534f;&#x4f5c;&#xff0c;&#x5171;&#x540c;&#x4fee;&#x6539;&#x3001;&#x5ba1;&#x9605;&#x6587;&#x6863;&#x3002;&#x8fd9;&#x4e9b;&#x6587;&#x6863;&#x6570;&#x636e;&#x81ea;&#x7136;&#x80fd;&#x591f;&#x4e0b;&#x8f7d;&#x4e0b;&#x6765;&#xff0c;&#x4f46;&#x9996;&#x5148;&#x5b83;&#x4eec;&#x4e0d;&#x4fdd;&#x8bc1;&#x80fd;&#x591f;&#x4e0e; Microsoft Office &#x5b8c;&#x5168;&#x517c;&#x5bb9;&#xff0c;&#x5176;&#x6b21;&#x5728;&#x5927;&#x4f01;&#x4e1a;&#x5185;&#x5c06;&#x6240;&#x6709;&#x7684;&#x5458;&#x5de5;&#x90fd;&#x8fc1;&#x79fb;&#x5230;&#x53e6;&#x4e00;&#x4e2a;&#x5e73;&#x53f0;&#x4e0a;&#x4e5f;&#x662f;&#x76f8;&#x5f53;&#x5927;&#x7684;&#x5f00;&#x9500;&#x3002;</p>
<h2>&#x5784;&#x65ad;&#x5bf9;&#x4e8e;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x7684;&#x5f71;&#x54cd;</h2>
<p>Anderson &#x7528;&#x4e86;&#x76f8;&#x5f53;&#x5927;&#x7684;&#x7bc7;&#x5e45;&#x6765;&#x4ecb;&#x7ecd;&#x7ecf;&#x6d4e;&#x5b66;&#x65b9;&#x9762;&#x7684;&#x6982;&#x5ff5;&#xff0c;&#x4ee5;&#x53ca;&#x79d1;&#x6280;&#x516c;&#x53f8;&#x5982;&#x4f55;&#x5f62;&#x6210;&#x5784;&#x65ad;&#x3002;&#x90a3;&#x4e48;&#x5784;&#x65ad;&#x7a76;&#x7adf;&#x5bf9;&#x4e8e;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x6709;&#x4ec0;&#x4e48;&#x5371;&#x5bb3;&#xff1f;</p>
<p>&#x9996;&#x5148;&#xff0c;&#x5784;&#x65ad;&#x516c;&#x53f8;&#x4f5c;&#x4e3a;&#x4fe1;&#x606f;&#x4e2d;&#x67a2;&#xff0c;&#x53ef;&#x80fd;&#x4f1a;&#x6ee5;&#x7528;&#x7528;&#x6237;&#x4fe1;&#x606f;&#x3002;&#x4f8b;&#x5982;&#xff0c;&#x5bf9;&#x4e8e; Google &#x7684;&#x5e7f;&#x544a;&#x4e1a;&#x52a1;&#xff0c;&#x5728;&#x62cd;&#x5356;&#x7ade;&#x4ef7;&#x7684;&#x8fc7;&#x7a0b;&#x4e2d;&#xff0c; Google &#x5f88;&#x53ef;&#x80fd;&#x4f1a;&#x5411;&#x7b2c;&#x4e09;&#x65b9;&#x62ab;&#x9732;&#x7528;&#x6237;&#x7684;&#x76f8;&#x5173;&#x4fe1;&#x606f;&#xff0c;&#x800c;&#x7b2c;&#x4e09;&#x65b9;&#x5e7f;&#x544a;&#x5546;&#x5229;&#x7528;&#x5dee;&#x5206;&#x8ba1;&#x7b97;&#x7b49;&#x6280;&#x672f;&#x53ef;&#x4ee5;&#x4ece;&#x8fd9;&#x4e9b;&#x4fe1;&#x606f;&#x4e2d;&#x83b7;&#x53d6;&#x7528;&#x6237;&#x7684;&#x76f8;&#x5173;&#x6570;&#x636e;&#xff0c;&#x8fd9;&#x5c31;&#x5e26;&#x6765;&#x4e86;&#x6781;&#x5927;&#x7684;&#x9690;&#x79c1;&#x9690;&#x60a3;&#x3002;&#x6b64;&#x5916;&#xff0c;&#x8fd9;&#x4e9b;&#x5784;&#x65ad;&#x516c;&#x53f8;&#x62e5;&#x6709;&#x5927;&#x91cf;&#x7684;&#x7528;&#x6237;&#x4fe1;&#x606f;&#xff0c;&#x4e00;&#x65e6;&#x53d1;&#x751f;&#x6570;&#x636e;&#x6cc4;&#x6f0f;&#x4e8b;&#x6545;&#xff0c;&#x5373;&#x4f7f;&#x662f;&#x76f8;&#x5bf9;&#x6765;&#x8bf4;&#x89c4;&#x6a21;&#x8f83;&#x5c0f;&#x7684;&#xff0c;&#x5176;&#x5f71;&#x54cd;&#x90fd;&#x5c06;&#x975e;&#x5e38;&#x4e25;&#x91cd;&#x3002;</p>
<p>&#x5176;&#x6b21;&#xff0c;&#x8868;&#x9762;&#x4e0a;&#x770b;&#xff0c;&#x4f7f;&#x7528; Google &#x7684;&#x641c;&#x7d22;&#x3001;&#x6587;&#x6863;&#x53ca;&#x5728;&#x7ebf;&#x89c6;&#x9891;&#x7b49;&#x4ea7;&#x54c1;&#x90fd;&#x662f;&#x514d;&#x8d39;&#x7684;&#xff0c;&#x4f46;&#x5b9e;&#x9645;&#x4e0a;&#x8fd9;&#x5176;&#x4e2d;&#x90fd;&#x9690;&#x542b;&#x4e86;&#x5927;&#x91cf;&#x7684;&#x6210;&#x672c;&#xff0c;&#x4f8b;&#x5982;&#x8fc1;&#x79fb;&#x7684;&#x6210;&#x672c;&#xff1a;&#x4f7f;&#x7528; Google &#x6587;&#x6863;&#x7684;&#x7528;&#x6237;&#x81ea;&#x7136;&#x53ef;&#x4ee5;&#x968f;&#x65f6;&#x5207;&#x6362;&#x5230;&#x5176;&#x4ed6;&#x670d;&#x52a1;&#xff0c;&#x4f46;&#x5c06;&#x6240;&#x6709;&#x6587;&#x6863;&#x4ece; Google &#x4e0b;&#x8f7d;&#x56de;&#x6765;&#x518d;&#x4e0a;&#x4f20;&#x5230;&#x65b0;&#x7684;&#x670d;&#x52a1;&#x4e0a;&#x53bb;&#x672c;&#x8eab;&#x5c31;&#x662f;&#x975e;&#x5e38;&#x5927;&#x7684;&#x65f6;&#x95f4;&#x5f00;&#x9500;&#xff0c;&#x66f4;&#x4e0d;&#x8981;&#x8bf4; Google &#x6587;&#x6863;&#x53ef;&#x80fd;&#x8fd8;&#x63d0;&#x4f9b;&#x4e86;&#x4e00;&#x4e9b;&#x72ec;&#x5bb6;&#x529f;&#x80fd;&#xff0c;&#x5728;&#x65b0;&#x670d;&#x52a1;&#x5e73;&#x53f0;&#x4e0a;&#x8fd9;&#x4e9b;&#x529f;&#x80fd;&#x5f88;&#x96be;&#x627e;&#x5230;&#x66ff;&#x4ee3;&#x54c1;&#x3002;&#x5bf9;&#x4e8e;&#x4e2a;&#x4eba;&#x7528;&#x6237;&#x6765;&#x8bf4;&#xff0c;&#x8fd9;&#x4e9b;&#x597d;&#x50cf;&#x5e76;&#x4e0d;&#x662f;&#x5e76;&#x4e0d;&#x4f1a;&#x6709;&#x975e;&#x5e38;&#x663e;&#x8457;&#x7684;&#x5f71;&#x54cd;&#xff0c;&#x7136;&#x800c;&#x5bf9;&#x4e8e;&#x4e00;&#x4e2a;&#x4f01;&#x4e1a;&#x6765;&#x8bf4;&#xff0c;&#x8fd9;&#x79cd;&#x6210;&#x672c;&#x662f;&#x5de8;&#x5927;&#x7684;&#x3002;</p>
<p>&#x53e6;&#x5916;&#xff0c;&#x4fe1;&#x606f;&#x4e0d;&#x5bf9;&#x79f0;&#x7684;&#x53e6;&#x5916;&#x4e00;&#x4e2a;&#x5f71;&#x54cd;&#x5c31;&#x662f;&#xff0c;<strong>&#x7528;&#x6237;&#x4f1a;&#x503e;&#x5411;&#x4e8e;&#x4f7f;&#x7528;&#x66f4;&#x4fbf;&#x5b9c;&#x7684;&#x4ea7;&#x54c1;&#xff0c;&#x800c;&#x4e0d;&#x662f;&#x66f4;&#x5b89;&#x5168;&#x7684;</strong>&#x3002;&#x5bf9;&#x4e8e;&#x7528;&#x6237;&#x6765;&#x8bf4;&#xff0c;&#x5e02;&#x573a;&#x4e0a;&#x6709;&#x4e24;&#x4e2a;&#x529f;&#x80fd;&#x76f8;&#x8fd1;&#x7684;&#x4ea7;&#x54c1;&#x65f6;&#xff0c;&#x5982;&#x679c;&#x7528;&#x6237;&#x4e0d;&#x80fd;&#x5206;&#x8fa8;&#x51fa;&#x5b70;&#x4f18;&#x5b70;&#x52a3;&#xff0c;&#x4ed6;&#x4eec;&#x5c31;&#x4f1a;&#x503e;&#x5411;&#x4e8e;&#x9009;&#x62e9;&#x66f4;&#x4fbf;&#x5b9c;&#x7684;&#x4ea7;&#x54c1;&#xff1b;&#x79d1;&#x6280;&#x5784;&#x65ad;&#x516c;&#x53f8;&#x4e3a;&#x4e86;&#x62a2;&#x5360;&#x5e02;&#x573a;&#xff0c;&#x4f1a;&#x503e;&#x5411;&#x4e8e;&#x4f18;&#x5148;&#x5f00;&#x53d1;&#x529f;&#x80fd;&#xff0c;&#x5b89;&#x5168;&#x6027;&#x80fd;&#x4f5c;&#x4e3a;&#x7528;&#x6237;&#x4e0d;&#x80fd;&#x7acb;&#x9a6c;&#x76f4;&#x89c2;&#x611f;&#x53d7;&#x5230;&#x7684;&#x65b9;&#x9762;&#x5c31;&#x4f1a;&#x88ab;&#x5ffd;&#x89c6;&#xff0c;&#x76f8;&#x5f53;&#x4e8e;&#x5c06;&#x5b89;&#x5168;&#x7684;&#x6210;&#x672c;&#x4e0e;&#x8d23;&#x4efb;&#x8f6c;&#x5ac1;&#x7ed9;&#x4e86;&#x7528;&#x6237;&#xff08;&#x5927;&#x591a;&#x6570;&#x4ea7;&#x54c1;&#x7684;&#x4f7f;&#x7528;&#x6761;&#x6b3e;&#x91cc;&#x90fd;&#x4f1a;&#x8bf4;&#x660e;&#xff0c;&#x4f7f;&#x7528;&#x4ea7;&#x54c1;&#x800c;&#x5bfc;&#x81f4;&#x7684;&#x635f;&#x5931;&#x7531;&#x7528;&#x6237;&#x627f;&#x62c5;&#xff0c;&#x5927;&#x591a;&#x6570;&#x5382;&#x5546;&#x4fee;&#x590d;&#x5b89;&#x5168;&#x95ee;&#x9898;&#x53ea;&#x4e0d;&#x8fc7;&#x662f;&#x4e3a;&#x4e86;&#x4fdd;&#x8bc1;&#x4ea7;&#x54c1;&#x80fd;&#x591f;&#x7ee7;&#x7eed;&#x5728;&#x5e02;&#x573a;&#x4e0a;&#x9500;&#x552e;&#x4e0b;&#x53bb;&#xff09;&#xff0c;&#x6700;&#x7ec8;&#x5f62;&#x6210;&#x52a3;&#x5e01;&#x9a71;&#x9010;&#x826f;&#x5e01;&#x7684;&#x5e02;&#x573a;&#x6001;&#x52bf;&#x3002;</p>
<h2>&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x5bf9;&#x4e8e;&#x7ecf;&#x6d4e;&#x53ca;&#x793e;&#x4f1a;&#x7684;&#x610f;&#x4e49;</h2>
<p>&#x4fe1;&#x606f;&#x4ea7;&#x4e1a;&#x81ea;&#x8eab;&#x4e5f;&#x53c2;&#x4e0e;&#x793e;&#x4f1a;&#x7ecf;&#x6d4e;&#x6d3b;&#x52a8;&#xff0c;&#x56e0;&#x6b64;&#x6211;&#x4eec;&#x5728;&#x5173;&#x6ce8;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x65f6;&#x81ea;&#x7136;&#x4e5f;&#x4f1a;&#x5173;&#x6ce8;&#x8fd9;&#x6837;&#x4e00;&#x4e2a;&#x95ee;&#x9898;&#xff0c;&#x5373;&#x7814;&#x7a76;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x5230;&#x5e95;&#x80fd;&#x5e26;&#x7ed9;&#x6211;&#x4eec;&#x600e;&#x6837;&#x7684;&#x6536;&#x76ca;&#x3002;&#x6700;&#x6d45;&#x663e;&#x7684;&#x5c42;&#x6b21;&#x81ea;&#x7136;&#x5728;&#x4e8e;&#x4fdd;&#x8bc1;&#x4fe1;&#x606f;&#x7cfb;&#x7edf;&#x4e0d;&#x53d7;&#x653b;&#x51fb;&#xff0c;&#x4fe1;&#x606f;&#x4e0d;&#x4f1a;&#x6536;&#x5230;&#x7be1;&#x6539;&#x3002;Anderson &#x5219;&#x6307;&#x51fa;&#xff0c;&#x8fd9;&#x6837;&#x7684;&#x7406;&#x89e3;&#x5e76;&#x4e0d;&#x80fd;&#x5e2e;&#x52a9;&#x6211;&#x4eec;&#x6539;&#x53d8;&#x5f53;&#x524d;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x88ab;&#x5927;&#x4f17;&#x8f7b;&#x89c6;&#x7684;&#x73b0;&#x72b6;&#x3002;&#x5b9e;&#x9645;&#x4e0a;&#xff0c;&#x5b89;&#x5168;&#x662f;&#x4e00;&#x79cd;&#x5e73;&#x8861;&#xff0c;&#x8fc7;&#x5ea6;&#x5730;&#x8ffd;&#x6c42;&#x5b89;&#x5168;&#x4f1a;&#x5bfc;&#x81f4;&#x6211;&#x4eec;&#x6240;&#x505a;&#x7684;&#x4e00;&#x5207;&#x4e8b;&#x60c5;&#x90fd;&#x9700;&#x8981;&#x76f8;&#x5f53;&#x9ad8;&#x7684;&#x6210;&#x672c;&#xff1b;&#x66f4;&#x8fdb;&#x4e00;&#x6b65;&#x5730;&#x8bf4;&#xff0c;&#x5b89;&#x5168;&#x662f;&#x4e00;&#x79cd;&#x6743;&#x529b;&#x7684;&#x5206;&#x914d;&#xff0c;&#x62e5;&#x6709;&#x6743;&#x529b;&#x7684;&#x4eba;&#x5728;&#x7ed9;&#x5b9a;&#x7684;&#x7cfb;&#x7edf;&#x4e2d;&#x51b3;&#x5b9a;&#x89c4;&#x5219;&#xff0c;&#x8fbe;&#x5230;&#x6700;&#x5927;&#x5316;&#x81ea;&#x8eab;&#x5229;&#x76ca;&#x7684;&#x76ee;&#x7684;&#x3002;</p>
<p>&#x6b64;&#x5916;&#xff0c;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x5bf9;&#x4e8e;&#x6211;&#x4eec;&#x7684;&#x610f;&#x4e49;&#x5e76;&#x4e0d;&#x5728;&#x4e8e;&#x6211;&#x4eec;&#x4e2a;&#x4eba;&#xff0c;&#x66f4;&#x591a;&#x7684;&#x65f6;&#x5019;&#x4e5f;&#x5728;&#x4e8e;&#x793e;&#x4f1a;&#x3002;&#x5c31;&#x50cf;&#x5de5;&#x4e1a;&#x751f;&#x4ea7;&#x5411;&#x7a7a;&#x6c14;&#x4e2d;&#x6392;&#x653e;&#x6c61;&#x67d3;&#x7269;&#xff0c;&#x751f;&#x6d3b;&#x5728;&#x5468;&#x8fb9;&#x5730;&#x533a;&#x7684;&#x4eba;&#x4eec;&#x5e76;&#x6ca1;&#x6709;&#x53c2;&#x4e0e;&#x751f;&#x4ea7;&#xff0c;&#x5374;&#x9700;&#x8981;&#x5171;&#x540c;&#x627f;&#x53d7;&#x6c61;&#x67d3;&#xff1b;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x4e5f;&#x5177;&#x6709;&#x7c7b;&#x4f3c;&#x7684;&#x5c5e;&#x6027;&#xff0c;&#x67d0;&#x4e2a;&#x4eba;&#x4e0d;&#x91cd;&#x89c6;&#x9690;&#x79c1;&#x4e0e;&#x6570;&#x636e;&#x5b89;&#x5168;&#xff0c;&#x6700;&#x7ec8;&#x5374;&#x6709;&#x53ef;&#x80fd;&#x4f1a;&#x5bfc;&#x81f4;&#x7f51;&#x7edc;&#x4e2d;&#x7684;&#x6240;&#x6709;&#x4eba;&#x5171;&#x540c;&#x8499;&#x53d7;&#x5a01;&#x80c1;&#xff0c;&#x9020;&#x6210;&#x66f4;&#x5927;&#x89c4;&#x6a21;&#x7684;&#x7ecf;&#x6d4e;&#x635f;&#x5931;&#x3002;</p>
<p>&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x4e2d;&#x7814;&#x7a76;&#x7684;&#x95ee;&#x9898;&#x5bf9;&#x4e8e;&#x9884;&#x9632;&#x72af;&#x7f6a;&#x4e5f;&#x975e;&#x5e38;&#x91cd;&#x8981;&#x3002;Anderson &#x6307;&#x51fa;&#xff0c;&#x76ee;&#x524d;&#x793e;&#x4f1a;&#x72af;&#x7f6a;&#x7387;&#x8868;&#x9762;&#x4e0a;&#x6709;&#x4e0b;&#x964d;&#x7684;&#x8d8b;&#x52bf;&#xff0c;&#x4f46;&#x66f4;&#x6709;&#x53ef;&#x80fd;&#x7684;&#x662f;&#x72af;&#x7f6a;&#x53ea;&#x662f;&#x4ece;&#x73b0;&#x5b9e;&#x793e;&#x4f1a;&#x8f6c;&#x79fb;&#x5230;&#x4e86;&#x7f51;&#x7edc;&#x7a7a;&#x95f4;&#x91cc;&#xff0c;&#x800c;&#x7f51;&#x7edc;&#x7a7a;&#x95f4;&#x4e2d;&#x7684;&#x72af;&#x7f6a;&#x5f80;&#x5f80;&#x66f4;&#x96be;&#x8ffd;&#x8e2a;&#xff08;&#x6709;&#x8da3;&#x7684;&#x662f;&#xff0c;&#x6b63;&#x662f;&#x56e0;&#x4e3a;&#x6211;&#x4eec;&#x91cd;&#x89c6;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#xff0c;&#x624d;&#x53cd;&#x8fc7;&#x6765;&#x5bfc;&#x81f4;&#x4e86;&#x7f6a;&#x72af;&#x4e5f;&#x5f88;&#x96be;&#x88ab;&#x8ffd;&#x8e2a;&#xff09;&#x3002;&#x7136;&#x800c;&#x76ee;&#x524d;&#x7f51;&#x7edc;&#x7a7a;&#x95f4;&#x72af;&#x7f6a;&#x9020;&#x6210;&#x7684;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x635f;&#x5931;&#x4e5f;&#x5f88;&#x96be;&#x88ab;&#x51c6;&#x786e;&#x4f30;&#x91cf;&#xff0c;&#x76f8;&#x5173;&#x7684;&#x51fa;&#x7248;&#x7269;&#x4e0e;&#x653f;&#x5e9c;&#x90e8;&#x95e8;&#x4e3a;&#x4e86;&#x8d77;&#x5230;&#x9884;&#x9632;&#x4f5c;&#x7528;&#x3001;&#x5f15;&#x8d77;&#x91cd;&#x89c6;&#xff0c;&#x5f80;&#x5f80;&#x90fd;&#x4f1a;&#x5c06;&#x5177;&#x4f53;&#x7684;&#x6570;&#x5b57;&#x5938;&#x5927;&#x3002;</p>
<h2>&#x603b;&#x7ed3;</h2>
<p>Anderson &#x975e;&#x5e38;&#x7cfb;&#x7edf;&#x5730;&#x63cf;&#x8ff0;&#x4e86;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x4e0e;&#x7ecf;&#x6d4e;&#x4e4b;&#x95f4;&#x7684;&#x5173;&#x7cfb;&#xff0c;&#x4ed6;&#x6240;&#x63d0;&#x51fa;&#x7684;&#x8fd9;&#x4e9b;&#x89c1;&#x89e3;&#x4e00;&#x65b9;&#x9762;&#x5256;&#x6790;&#x4e86;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x4e3a;&#x4ec0;&#x4e48;&#x5f53;&#x524d;&#x53d7;&#x5230;&#x666e;&#x904d;&#x5ffd;&#x89c6;&#xff0c;&#x53e6;&#x4e00;&#x65b9;&#x9762;&#x4e5f;&#x660e;&#x786e;&#x8868;&#x793a;&#x4e86;&#x4fe1;&#x606f;&#x5b89;&#x5168;&#x7684;&#x91cd;&#x8981;&#x6027;&#x3002;&#x4f5c;&#x4e3a;&#x4ece;&#x4e1a;&#x8005;&#x7684;&#x6211;&#x4eec;&#x5e94;&#x5f53;&#x91cd;&#x89c6;&#x8d77;&#x6765;&#xff0c;&#x5728;&#x65e5;&#x5e38;&#x7684;&#x5b9e;&#x8df5;&#x4e2d;&#x591a;&#x52a0;&#x53cd;&#x601d;&#x3002;</p>

  </article>
</main>
    <footer class="flex">
  <a href="/">&#xa9; Harlan V. Wei (aka. Wei Chen)</a>
  <strong></strong>
</footer>
  </body>

</html>